---
kind: method
id: M:Autodesk.Revit.UI.RibbonItem.SetContextualHelp(Autodesk.Revit.UI.ContextualHelp)
source: html/746fe5b0-c38b-56ae-b681-f7b3b816ea7d.htm
---
# Autodesk.Revit.UI.RibbonItem.SetContextualHelp Method

Sets the contextual help bound with this button.

## Syntax (C#)
```csharp
public void SetContextualHelp(
	ContextualHelp contextualHelp
)
```

## Parameters
- **contextualHelp** (`Autodesk.Revit.UI.ContextualHelp`) - The contextual help.